import { Container, Box, Typography } from '@mui/material';
import { ReactElement } from 'react';

export const PersonalDataRights = ():ReactElement => {
  return(
    <Container maxWidth="md">
      <Typography variant="h6" gutterBottom fontWeight="bold">
        ПОВІДОМЛЕННЯ ПРО ПРАВА АБОНЕНТА, ЯК СУБ’ЄКТА ПЕРСОНАЛЬНИХ ДАНИХ
      </Typography>

      <Typography>
        В процесі надання абонентам електронних комунікаційних послуг, Акціонерним товариством «Укртелеком» (далі – Товариство), як володільцем бази персональних даних, здійснюється обробка персональних даних абонентів. Обробка персональних даних здійснюється з дотриманням вимог Закону України «Про захист персональних даних». До складу персональних даних, обробка яких здійснюється Товариством, входять:
      </Typography>

      <Box component="ul" sx={{ pl: 3, mb: 1 }}>
        <li>Прізвище, ім’я, по-батькові (за наявності);</li>
        <li>Серія та номер паспорту;</li>
        <li>РНОКПП – реєстраційний номер облікової картки платника податків (раніше ІПН);</li>
        <li>Адреса надання послуги;</li>
        <li>Номер телефону, адреса електронної пошти;</li>
        <li>Інформація про наявне право на пільги;</li>
      </Box>

      <Typography>
        Метою збору персональних даних є правове забезпечення надання електронних комунікаційних послуг абонентам, що включає в себе:
      </Typography>

      <Box component="ul" sx={{ pl: 3, mb: 1 }}>
        <li>Укладення договору про надання електронних комунікаційних послуг;</li>
        <li>Виставлення рахунку за надані послуги;</li>
        <li>Забезпечення своєчасної та повної оплати;</li>
        <li>Інформування абонентів про зміни тарифів, послуг та комерційні пропозиції;</li>
      </Box>

      <Typography>
        Для реалізації вищезазначеної мети персональні дані можуть передаватись іншим особам, зокрема:
      </Typography>

      <Box component="ul" sx={{ pl: 3, mb: 1 }}>
        <li>«Укрпошта», ТОВ «Нова Пошта» – для надсилання рахунків та обладнання;</li>
        <li>ТОВ «Квадра Асістанс», ТОВ «КК Карма», ТОВ «БА Пристав Україна», ТОВ «Дебтфорт Україна» – для вжиття заходів щодо оплати;</li>
        <li>ТОВ «МЕГОГО», ТОВ «Омега ТВ» – для підключення послуг інтерактивного телебачення;</li>
      </Box>

      <Typography>
        Даним повідомленням Товариство інформує абонентів про наступні права:
      </Typography>

      <Box component="ol" sx={{ pl: 3 }}>
        <li>1) Знати джерела збирання, місцезнаходження персональних даних та мету їх обробки;</li>
        <li>2) Отримувати інформацію про доступ до персональних даних, включно з третіми особами;</li>
        <li>3) Мати доступ до своїх персональних даних;</li>
        <li>4) Отримувати відповідь про обробку персональних даних протягом 30 днів;</li>
        <li>5) Заперечувати проти обробки своїх персональних даних;</li>
        <li>6) Вимагати зміни або знищення персональних даних, якщо вони обробляються незаконно;</li>
        <li>7) Захист від незаконної обробки, втрати або надання недостовірної інформації;</li>
        <li>8) Звертатися із скаргами на обробку до Уповноваженого або суду;</li>
        <li>9) Застосовувати правовий захист у разі порушення законодавства;</li>
        <li>10) Вносити застереження щодо обмеження обробки персональних даних;</li>
        <li>11) Відкликати згоду на обробку персональних даних;</li>
        <li>12) Знати механізм автоматичної обробки персональних даних;</li>
        <li>13) Захист від автоматизованого рішення з правовими наслідками.</li>
      </Box>
    </Container>
  );
}
