import { Container, Divider, Typography } from "@mui/material";

export const Router = () => {
  return (
    <Container maxWidth="md">
      <Typography variant="h6" gutterBottom>
        Гігабітний Wi-Fi роутер TP-Link Mercusys з функцією EasyMesh (дводіапазонний)
      </Typography>

      <Typography variant="body1" gutterBottom>
        Гігабітний Wi-Fi AC1200 – швидкість з’єднання до 867 Мбіт/с в діапазоні 5 ГГц і до 300 Мбіт/с в діапазоні 2,4 ГГц.
        Розширене покриття — завдяки чотирьом антенам з високим коефіцієнтом посилення і функції Beamforming стабільне Wi-Fi підключення буде у всьому будинку.
        Гігабітні порти — в десять разів швидше портів стандарту Fast Ethernet, Mercusys MR30G передає дані на великій швидкості для будь-яких дротових пристроїв, включаючи ПК, IPTV та ігрові консолі.
        Висока ефективність мережі — технологія MU-MIMO дозволяє MR30G взаємодіяти відразу з декількома пристроями, що збільшує загальну пропускну здатність мережі.
        EasyMesh — технологія дозволяє створити єдину Mesh мережу у всьому будинку з пристроями з функцією EasyMesh.
        Просте управління домашньою мережею через додаток — різноманітні функції, такі як батьківський контроль, пріоритизація (QoS) і гостьова мережа для підвищення безпеки та ефективності.
        Підтримка IPTV — підтримка IGMP Proxy / Snooping, режиму "Міст" і тегування VLAN для оптимізації потоків IPTV.
        Підтримка IPv6 — дозволяє користуватися сервісами IPv6 провайдера і відвідувати сайти IPv6.
      </Typography>

      <Divider sx={{ my: 3 }} />

      <Typography variant="h6" gutterBottom>
        Характеристики
      </Typography>

      <Typography variant="body2" gutterBottom>
        <strong>Бездротова мережа</strong><br />
        Бездротові стандарти: 5 ГГц — IEEE 802.11ac/n/a, 2,4 ГГц — IEEE 802.11b/g/n<br />
        Частота: 2,4 ГГц / 5 ГГц<br />
        Швидкість сигналу: до 867 Мбіт/с (5 ГГц) + до 300 Мбіт/с (2,4 ГГц)<br />
        Сумісність зі стандартами Wi-Fi: 11ac/a/b/g/n<br />
        Чутливість прийому: 11g 6 Мбіт/с: -96 дБм, 11g 54 Мбіт/с: -78 дБм, 11n HT40 MCS7: -74 дБм, 11n HT20 MCS7: -71 дБм, 11a 6 Мбіт/с: -97 дБм, 11a 54 Мбіт/с: -79 дБм, 11ac VHT20 MCS8: -74 дБм, 11ac VHT40 MCS9: -70 дБм, 11ac VHT80 MCS9: -65 дБм<br />
        Сила передачі: 20 дБм або 100 мВт<br />
        Захист бездротової мережі: WPA-PSK / WPA2-PSK<br />
        Протокол Mesh: EasyMesh
      </Typography>

      <Typography variant="body2" gutterBottom>
        <strong>Програмне забезпечення</strong><br />
        Режими роботи: Роутер, Точка доступу<br />
        Тип WAN: Динамічна IP-адреса / Статична IP-адреса / PPPoE / L2TP / PPTP<br />
        Управління: Контроль доступу, Локальне управління, Дистанційне управління<br />
        DHCP: Сервер, список DHCP-клієнтів<br />
        NAT Forwarding: Переадресація портів, запуск портів, UPnP, DMZ<br />
        Міжмережевий екран: SPI, прив'язка IP- і MAC-адрес<br />
        Гостьова мережа: 2,4 ГГц / 5 ГГц
      </Typography>

      <Typography variant="body2" gutterBottom>
        <strong>Апаратне забезпечення</strong><br />
        Розміри (ДхШхВ): 159,7 × 125,9 × 37,1 мм<br />
        Інтерфейси: 1 гігабітний порт WAN + 2 гігабітних порти LAN<br />
        Кнопки: WPS/Reset<br />
        Кількість антен: 4 фіксовані всеспрямовані антени 5 дБі
      </Typography>

      <Typography variant="body2" gutterBottom>
        <strong>Додаткова інформація</strong><br />
        Комплект постачання: Wi-Fi роутер (MR30G), Адаптер живлення, Посібник по швидкому налаштуванню, Кабель Ethernet RJ45
      </Typography>
    </Container>  )
}
